Revit 2027 API
StairsConstructionMethod Enumeration
 Represents the construction method of the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StairsConstructionMethod
Public Enumeration StairsConstructionMethod
public enum class StairsConstructionMethod
type StairsConstructionMethod
Members
Member name | Value | Description
Assembled | 0 |  The stairs is constructed by assembly method.
CastInPlace | 1 |  The stairs is constructed by cast-in-place method.
Precast | 2 |  The stairs is constructed by precast method.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace